练习:
  1. 北京出租车计价器
    收费标准:
      1. 3公里以内收费 13元
      2. 基本单价 2.3 元/公里(超过3公里以外)
      3. 空驶费: 超过15公里后,每公里加收单价的50%空驶费
         (即3.45元/公里)
    要求: 输入公里数,打印出费用金额(以元为单位精确到分)
  2. 输入三个任意的数:
    1) 打印出最大数是多少?
    2) 打印出最小数是多少?
    3) 打印出三个数的平均值是多少?
  3. BMI指数(Body Mass Index) 又称身体质量指数
    BMI计算公式:  BMI = 体重(公斤) / 身高的平方(米)
    如:  一个69公斤的人,身高是173厘米 则BMI如下:
       BMI = 69 / 1.73 ** 2    得23.05
    标准表:
      BMI < 18.5       体重过轻
      18.5 <= BMI < 24 正常范围
      BMI >= 24        体重过重
    输入身高和体重,打印出BMI值,并打印体重状况

      