#任意输入一个数字
#１判断这个数是否大于１００
#１判断是否小于０
#判断这个数是否在５０－－１５０之间
 
c = int(input("请输入一个数："))
if c > 100:
     ("这个数大于１００")

ｉｆ　c < 0:
     print("这个数小于０")
elif 50 < c < 100:
    print("这个数在５０到１００之间")   

    if2.py

if 语句真值表达式
if bool(100):
    if 嵌套
    if语句本身是由多条子句组成的一条复合语句

m = int(input("请输入一个月份："))
if 1<= m <= 12 :
    ("输入的是正常月份")
    if m <= 3:
        print("您输入的月份是春季")
    a m <= 6:
        print("您输入的是夏季")
    elif m <= 9:
        print("")
else:
    ("输入的月份不正确")    

写一个程序，输入一个整数，用if计算这个数的绝对值
i



