#打印圆的周长和面积
r = 3
p = 3.14
l = 2*p*r
s = p*r**2
print("圆的周长是：",l,"厘米")
print("圆的面积是：",s,"平方厘米")

在交互模式下查看当前作用域的所有变量
help("＿＿main＿＿")

del 语句
作用:
用于删除变量，同时解除与对象的关联，如果可能则释放对象
语法：
del 变量名１，
is／is not
小整数对象池：
cpython中，－５至２５６的数永远存在于小整数
id(x)函数
作用：
返回一个
练习：
1.在终端输出图形：
　　　*
    ***
   *****
  *******
  2.中国古代的称是１６两一斤，请问古代的２１６两是几斤几两
  写程序打印出来
  ３从凌晨０：０：０计时，到现在已经过了６３３２０秒，请问现在是几时几分几秒？写程序打印出来
  提示：可以用地板除和求余算出
  ４温度转换（华式温度／摄式温度／升式温度）
  算法：
  摄式温度＝５．０／９．０＊（华式温度－３２）

  开式温度＝摄氏温度+273.15
  问：
  100华式温度转为摄氏温度是多少度
  转为开式温度是多少度

　
　　　

